@file:Suppress("UNUSED_PARAMETER")

package lesson2

import java.lang.Math.sqrt
import kotlin.math.pow

/**
 * Получение наибольшей прибыли (она же -- поиск максимального подмассива)
 * Простая
 *
 * Во входном файле с именем inputName перечислены цены на акции компании в различные (возрастающие) моменты времени
 * (каждая цена идёт с новой строки). Цена -- это целое положительное число. Пример:
 *
 * 201
 * 196
 * 190
 * 198
 * 187
 * 194
 * 193
 * 185
 *
 * Выбрать два момента времени, первый из них для покупки акций, а второй для продажи, с тем, чтобы разница
 * между ценой продажи и ценой покупки была максимально большой. Второй момент должен быть раньше первого.
 * Вернуть пару из двух моментов.
 * Каждый момент обозначается целым числом -- номер строки во входном файле, нумерация с единицы.
 * Например, для приведённого выше файла результат должен быть Pair(3, 4)
 *
 * В случае обнаружения неверного формата файла бросить любое исключение.
 */
fun optimizeBuyAndSell(inputName: String): Pair<Int, Int> {
    TODO()
}

/**
 * Задача Иосифа Флафия.
 * Простая
 *
 * Образовав круг, стоят menNumber человек, пронумерованных от 1 до menNumber.
 *
 * 1 2 3
 * 8   4
 * 7 6 5
 *
 * Мы считаем от 1 до choiceInterval (например, до 5), начиная с 1-го человека по кругу.
 * Человек, на котором остановился счёт, выбывает.
 *
 * 1 2 3
 * 8   4
 * 7 6 х
 *
 * Далее счёт продолжается со следующего человека, также от 1 до choiceInterval.
 * Выбывшие при счёте пропускаются, и человек, на котором остановился счёт, выбывает.
 *
 * 1 х 3
 * 8   4
 * 7 6 Х
 *
 * Процедура повторяется, пока не останется один человек. Требуется вернуть его номер (в данном случае 3).
 *
 * 1 Х 3
 * х   4
 * 7 6 Х
 *
 * 1 Х 3
 * Х   4
 * х 6 Х
 *
 * х Х 3
 * Х   4
 * Х 6 Х
 *
 * Х Х 3
 * Х   х
 * Х 6 Х
 *
 * Х Х 3
 * Х   Х
 * Х х Х
 *
 * Общий комментарий: решение из Википедии для этой задачи принимается,
 * но приветствуется попытка решить её самостоятельно.
 */
fun josephTask(menNumber: Int, choiceInterval: Int): Int {
    TODO()
}

/**
 * Наибольшая общая подстрока.
 * Средняя
 *
 * Дано две строки, например ОБСЕРВАТОРИЯ и КОНСЕРВАТОРЫ.
 * Найти их самую длинную общую подстроку -- в примере это СЕРВАТОР.
 * Если общих подстрок нет, вернуть пустую строку.
 * При сравнении подстрок, регистр символов *имеет* значение.
 * Если имеется несколько самых длинных общих подстрок одной длины,
 * вернуть ту из них, которая встречается раньше в строке first.
 */
// T = O(M*N)
// R = O(N)
// N = second.length
// M = first.length
fun longestCommonSubstring(first: String, second: String): String {
    var i = 0
    var memoryij = Array(2) { Array(second.length) { 0 } }
    var lastIndex = 0
    var length = 0
    var max = 0
    while (i <= first.lastIndex) {
        var j = 0
        while (j <= second.lastIndex) {
            if (first[i] == second[j]) {
                var c = 0
                if (i == 0) {
                    memoryij[0][j] = 1
                    length = 1
                }
                if (j > 0)
                    c = memoryij[0][j - 1]
                if (c == 0) {
                    length = 1
                    memoryij[1][j] = 1
                } else {
                    memoryij[1][j] = c + 1
                    length = c + 1
                    if (length > max) {
                        max = length
                        lastIndex = i
                    }
                }
            }
            j++
        }
        memoryij = arrayOf(memoryij[1], Array(second.length) { 0 })
        i++
    }
    return (first.substring(lastIndex + 1 - max, lastIndex + 1))
}

/**
 * Число простых чисел в интервале
 * Простая
 *
 * Рассчитать количество простых чисел в интервале от 1 до limit (включительно).
 * Если limit <= 1, вернуть результат 0.
 *
 * Справка: простым считается число, которое делится нацело только на 1 и на себя.
 * Единица простым числом не считается.
 */
// T=O(N*ln(ln(N))) - решето Эратосфена
// R=O(N)
// N=limit
fun calcPrimesNumber(limit: Int): Int {
    if (limit <= 1)
        return 0
    val array = BooleanArray(limit) { true }
    array[0] = false
    for (i in 2..(sqrt(limit.toDouble())).toInt()) {
        var j = i.toDouble().pow(2).toInt()
        while (j <= limit) {
            array[j - 1] = false
            j += i
        }
    }
    return (array.count { it })
}
